import fetch from 'node-fetch'
let handler  = async (m, { conn, text }) => {
try {
let res = await fetch('https://i.imgur.com/JP52fdP.jpg')
let img = await res.buffer()
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let caption = `╭─────────────◆
│✯𝙷𝙰𝚃𝚂𝚄𝙽𝙴-𝙼𝙸𝙺𝚄-𝚄𝙻𝚃𝚁𝙰
│✯╭──────────◆
│✯│ʜᴏʟᴀ:${taguser}✯
│✯╰───────────◆
│✯╭──────────◆
│✯│ 𝐀𝐂𝐓𝐈𝐕𝐀𝐑 𝐎 𝐃𝐄𝐒𝐀𝐂𝐓𝐈𝐕𝐀𝐑
┃✯╰────────────◆
┃✯╭─────────────◆ 
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴡᴇʟᴄᴏᴍᴇ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴡᴇʟᴄᴏᴍᴇ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴍᴏᴅᴏʜᴏʀɴʏ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴍᴏᴅᴏʜᴏʀɴʏ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪʟɪɴᴋ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪʟɪɴᴋ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪʟɪɴᴋ2
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪʟɪɴᴋ2
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴅᴇᴛᴇᴄᴛ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴅᴇᴛᴇᴄᴛ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴛᴏxɪᴄ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴛᴏxɪᴄ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴛʀᴀʙᴀ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴛʀᴀʙᴀ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴀʀᴀʙᴇs
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴀʀᴀʙᴇs
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴍᴏᴅᴏᴀᴅᴍɪɴ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴍᴏᴅᴏᴀᴅᴍɪɴ
┃✯╰───────────◆
╰━━━━━━━━━━━──⊷
ᴏᴡɴᴇʀ:ᴏғᴄ➟ʏᴏᴠᴀɴɪ
ɴᴜᴍᴇʀᴏ:Wa.me/5212412377467`.trim()
conn.sendFile(m.chat, img, 'cat.jpg', caption, m)
} catch (e) {
console.log(e)
throw '*Error!*'
}}
handler.command = /^(enableactivar|Enableactivar)$/i
handler.fail = null
export default handler




