import fetch from 'node-fetch'
let handler  = async (m, { conn, text }) => {
try {
let res = await fetch('https://i.imgur.com/JP52fdP.jpg')
let img = await res.buffer()
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let caption = `╭─────────────◆
│✯𝙷𝙰𝚃𝚂𝚄𝙽𝙴-𝙼𝙸𝙺𝚄-𝚄𝙻𝚃𝚁𝙰
│✯╭──────────◆
│✯│ʜᴏʟᴀ:${taguser}✯
│✯╰───────────◆
│✯╭──────────◆
┃✯│✯-𝐎𝐖𝐍𝐄𝐑-⦿
┃✯╰────────────◆
┃✯╭──────────◆
┃✯│▢/sᴇᴛᴘʀᴇғɪx➟ᴘʀᴇғɪᴊᴏ
┃✯│▢/ʀᴇsᴇᴛᴘʀᴇғɪx
┃✯│▢/ᴀᴜᴛᴏᴀᴅᴍɪɴ
┃✯│▢/ʟᴇᴀᴠᴇɢᴄ
┃✯│▢/ʙʟᴏᴄᴋʟɪsᴛ
┃✯│▢/ʙʟᴏᴄᴋ➟@ᴛᴀɢ➟ɴᴜᴍᴇʀᴏ
┃✯│▢/ᴜɴʙʟᴏᴄᴋ➟@ᴛᴀɢ➟ɴᴜᴍᴇʀᴏ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ʀᴇsᴛʀɪᴄᴛ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ʀᴇsᴛʀɪᴄᴛ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀᴜᴛᴏʀᴇᴀᴅ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀᴜᴛᴏʀᴇᴀᴅ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴘᴜʙʟɪᴄ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴘᴜʙʟɪᴄ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴘᴄᴏɴʟʏ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴘᴄᴏɴʟʏ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ɢᴄᴏɴʟʏ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ɢᴄᴏɴʟʏ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴄᴀʟʟ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴄᴀʟʟ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴘʀɪᴠᴀᴅᴏ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴘʀɪᴠᴀᴅᴏ
┃✯│▢/ᴇɴᴀʙʟᴇ➟ᴍᴏᴅᴇᴊᴀᴅɪʙᴏᴛ
┃✯│▢/ᴅɪsᴀʙʟᴇ➟ᴍᴏᴅᴇᴊᴀᴅɪʙᴏᴛ
┃✯│▢/ᴍsɢ➟ᴛᴇxᴛᴏ
┃✯│▢/ʙᴀɴᴄʜᴀᴛ
┃✯│▢/ᴜɴʙᴀɴᴄʜᴀᴛ
┃✯│▢/ʙᴀɴᴜsᴇʀ➟@ᴛᴀɢ
┃✯│▢/ᴜɴʙᴀɴᴜsᴇʀ➟@ᴛᴀɢ
┃✯│▢/ᴅᴀʀᴅɪᴀᴍᴀɴᴛᴇs➟@ᴛᴀɢ
┃✯│▢/ʙᴀɴᴜsᴇʀ➟@ᴛᴀɢ
┃✯│▢/ʙᴄ➟ᴛᴇxᴛᴏ
┃✯│▢/ʙᴄᴄʜᴀᴛs➟ᴛᴇxᴛᴏ
┃✯│▢/ʙᴄɢᴄ➟ᴛᴇxᴛᴏ
┃✯│▢/ʙᴄɢᴄ2➟ᴀᴜᴅɪᴏ
┃✯│▢/ʙᴄɢᴄ2➟ᴠɪᴅᴇᴏ
┃✯│▢/ʙᴄɢᴄ2➟ɪᴍᴀɢᴇɴ
┃✯│▢/ʙᴄʙᴏᴛ➟ᴛᴇxᴛᴏ
┃✯│▢/ᴄʟᴇᴀʀᴛᴘᴍ
┃✯│▢/ʀᴇsᴛᴀʀᴛ
┃✯│▢/ᴜᴘᴅᴀᴛᴇ
┃✯│▢/ʙᴀɴʟɪsᴛ
┃✯│▢/ᴀᴅᴅᴘʀᴇᴍ➟@ᴛᴀɢ
┃✯│▢/ᴅᴇʟᴘʀᴇᴍ➟@ᴛᴀɢ
┃✯│▢/ʟɪsᴛᴘʀᴇᴍ
┃✯│▢/ʟɪsᴛᴄᴍᴅ
┃✯│▢/sᴇᴛᴘᴘʙᴏᴛ➟ʀᴇsᴘᴏɴᴅᴇʀ➟ᴀ➟ɪᴍᴀɢᴇɴ
┃✯│▢/ᴀᴅᴅᴄᴍᴅ➟ᴛᴇxᴛᴏ➟ʀᴇsᴘᴏɴᴅᴇʀ➟ᴀ➟sᴛɪᴄᴋᴇʀ➟ɪᴍᴀɢᴇɴ
┃✯│▢/ᴅᴇʟᴄᴍᴅ➟ʀᴇsᴘᴏɴᴅᴇʀ➟ᴀ➟sᴛɪᴄᴋᴇʀ➟ɪᴍᴀɢᴇɴ➟ᴄᴏɴ➟ᴄᴏᴍᴀɴᴅᴏ➟ᴏ➟ᴛᴇxᴛᴏ➟ᴀsɪɢɴᴀᴅᴏ
┃✯╰───────────◆
╰━━━━━━━━━━━──⊷
ᴏᴡɴᴇʀ:ᴏғᴄ➟ʏᴏᴠᴀɴɪ
ɴᴜᴍᴇʀᴏ:Wa.me/5212412377467`.trim()
conn.sendFile(m.chat, img, 'cat.jpg', caption, m)
} catch (e) {
console.log(e)
throw '*Error!*'
}}
handler.command = /^(permisosowner|Permisosowner)$/i
handler.fail = null
export default handler




