import fetch from 'node-fetch'
let handler  = async (m, { conn, text }) => {
try {
let res = await fetch('https://i.imgur.com/Za59fYH.jpg')
let img = await res.buffer()
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let caption = `╭─────────────◆
│✯𝙷𝙰𝚃𝚂𝚄𝙽𝙴-𝙼𝙸𝙺𝚄-𝚄𝙻𝚃𝚁𝙰
│✯╭──────────◆
│✯│ʜᴏʟᴀ:${taguser}✯
│✯╰───────────◆
│✯╭──────────◆
┃✯│✯-𝐃𝐄𝐒𝐂𝐀𝐑𝐆𝐀𝐒-⦿
┃✯╰────────────◆
┃✯╭──────────◆
┃✯│▢/ɪɴsᴛᴀɢʀᴀᴍ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ɪɴsᴛᴀɢʀᴀᴍ2➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ɪɴsᴛᴀɢʀᴀᴍ3➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ᴍᴇᴅɪᴀғɪʀᴇ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ɪɴsᴛᴀɢʀᴀᴍ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ɢɪᴛᴄʟᴏɴᴇ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ɢᴅʀɪᴠᴇ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ᴛɪᴋᴛᴏᴋ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/xɴxxᴅʟ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/xᴠɪᴅᴇᴏsᴅʟ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ᴛᴡɪᴛᴛᴇʀ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ғʙ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ғʙ2➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ғʙ3➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ғʙ4➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ғʙ5➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ʏᴛᴍᴘ3➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ʏᴛᴍᴘ4➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ʏᴛᴍᴘ3ᴅᴏᴄ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ʏᴛᴍᴘ4ᴅᴏᴄ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ᴅᴀᴘᴋ2➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/sᴛɪᴄᴋᴇʀᴘᴀᴄᴋ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃✯│▢/ᴘʟᴀʏ➟ᴛᴇxᴛᴏ
┃✯│▢/ᴘʟᴀʏ.1➟ᴛᴇxᴛᴏ
┃✯│▢/ᴘʟᴀʏ.2➟ᴛᴇxᴛᴏ
┃✯│▢/ᴘʟᴀʏᴅᴏᴄ➟ᴛᴇxᴛᴏ
┃✯│▢/ᴘʟᴀʏʟɪsᴛ➟ᴛᴇxᴛᴏ
┃✯│▢/ᴘʟᴀʏʟɪsᴛ2➟ᴛᴇxᴛᴏ
┃✯│▢/sᴘᴏᴛɪғʏ➟ᴛᴇxᴛᴏ
┃✯│▢/sᴛɪᴄᴋᴇʀʟʏ➟ᴛᴇxᴛᴏ
┃✯│▢/ʀɪɴɢᴛᴏɴᴇ➟ᴛᴇxᴛᴏ
┃✯│▢/sᴏᴜɴᴅᴄʟᴏᴜᴅ➟ᴛᴇxᴛᴏ
┃✯│▢/ɪᴍᴀɢᴇɴ➟ᴛᴇxᴛᴏ
┃✯│▢/ᴘɪɴᴛᴇʀᴇsᴛ➟ᴛᴇxᴛᴏ
┃✯│▢/ᴡᴀʟʟᴘᴀᴘᴇʀ➟ᴛᴇxᴛᴏ
┃✯│▢/ᴡᴀʟʟᴘᴀᴘᴇʀ2➟ᴛᴇxᴛᴏ
┃✯│▢/ᴘᴘᴛɪᴋᴛᴏᴋ➟ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ
┃✯│▢/ɪɢsᴛᴀʟᴋ➟ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ
┃✯│▢/ɪɢsᴛᴏʀʏ➟ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ
┃✯│▢/ᴛɪᴋᴛᴏᴋsᴛᴀʟᴋ➟ᴜsᴇʀɴᴀᴍᴇ
┃✯╰───────────◆
╰━━━━━━━━━━━──⊷
ᴏᴡɴᴇʀ:ᴏғᴄ➟ʏᴏᴠᴀɴɪ
ɴᴜᴍᴇʀᴏ:Wa.me/5212412377467`.trim()
conn.sendFile(m.chat, img, 'cat.jpg', caption, m)
} catch (e) {
console.log(e)
throw '*Error!*'
}}
handler.command = /^(descargasmuci|Descargasmuci)$/i
handler.fail = null
export default handler




